Tekla.Structures.Plugins.DirectManipulation.Services.TextRepresentationTypes
The Tekla.Structures.Plugins.DirectManipulation.Services.TextRepresentationTypes enum defines what a text represents.
This affects the text color, size and formatting in a way that is then consistent in the GUI.

Tekla.Structures.Plugins.DirectManipulation.Services.TextRepresentationTypes.Label
The text represents a label for an object.

Tekla.Structures.Plugins.DirectManipulation.Services.TextRepresentationTypes.Measurement
The text represents a measurement.

Tekla.Structures.Plugins.DirectManipulation.Services.TextRepresentationTypes.Angle
The text represents an angle.

Tekla.Structures.Plugins.DirectManipulation.Services.TextRepresentationTypes.Message
The text is a message for the user.

Tekla.Structures.Plugins.DirectManipulation.Services.TextRepresentationTypes.Warning
The text is a warning to the user.

Tekla.Structures.Plugins.DirectManipulation.Services.TextRepresentationTypes.Debug
The text is intended for debug purposes.

Tekla.Structures.Plugins.DirectManipulation.Services.TextRepresentationTypes.Interactive
The text is interactive.